  #Економіст
while True:	
  print("/------------------------\ ");
  print("|   Помічник економіста  |");
  print("\------------------------/ ",end='\n\n');
  print('1. Розрахунок заробітньої платні працівника"На руки".');
  print("2. Калькулятор відсотків");
  print("3. Конвертатор валют");
  print("4. Розрахунок прибутку чи збитків компанії");
  print("5. Рентабельність капіталу");
  print("6. Рівняння Фішера");
  print("7. Рентабельність власного капіталу");
  print("8. Податки");
  print("9. Про програму");
  print("0. Вихід",end='\n\n');

  s = int(input("Оберіть пункт меню:->"));
  while s>9 or s<0 :            #Запрошує знову вибору пункту меню якщо введена невірна   цифра.
    print("Введіть цифру яка присутня в меню")
    s = int(input("Оберіть пункт меню:->"));
  print(end='\n\n');
  if s == 0:       #Вихід
    print("Роботу завершено.");
    exit();
  if s == 9:        #Про програму
    print("Розробник: Оврамець Ілля Володимирович");
    print("Група КН-20 підгрупа В");
    input('Нажміть Enter для продовження');
  if s == 1:           #Розрахунок заробітньої платні працівника"На руки"
    h = int(input('Введіть вартість 1 робочої години:'));
    _v = int(input('Введіть кількість робочих годин:'));
    rp= h * _v
    pri= rp / 100 * 19.5
    salari= rp - pri
    print('Заробітна платня робітника "Грязними" :',rp);
    print('Податок в цілому',pri);
    print('Заробітна платня робітника "На руки" :',salari);    
  if s == 2:              #Калькулятор відсотків
    while True:
      print("Значення суми 0 повертає в меню",end='\n');
      summ=int(input('Введіть суму -->'));
      if summ == 0:
        break
      oper=input('Виберіть операцію + чи - ==>');
      proc=float(input('Введіть вітсоток на який слід збільшити   чи зменшити суму->'));
      _proc=summ/100*proc
      if oper == '+':
        rez= summ + _proc
        print("Результат",rez);
      if oper == '-':
        rez= summ - _proc
        print("Результат",rez);
      input('Нажміть Enter для продовження');
  if s == 3:             #Конвертатор валют
    mani=float(input('Введіть суму яку хочете конвертувати-->'));
    kur=float(input('Введіть курс валюти в яку хочете конвертувати-->'));
    _rez = kur * mani
    print("Сума після конвертації:",_rez);
  if s == 4:            #Розрахунок прибутку чи збитків компанії
    vv = int(input('Введіть виручку від реалізації-->'));
    sv = int(input('Введіть собівартість продукції(повну)-->'));
    prib= vv - sv
    if prib > 0:
      print("Компанія є прибутковою:");
      print("Прибуток:",prib);
    if prib == 0:
      print("Компанія залишається в нулі"); 
    if prib < 0:
      print("Комапнія є збитковою:");
      print("Збитки:",prib);
    input('Нажміть Enter для продовження');  
  if s == 5:            #Рентабельність капіталу
    pribb=int(input('Введіть прибуток-->'))
    kapp=int(input('Введіть капітал-->'))
    rent= pribb / kapp * 100
    print("Рентабельність компанії:",rent, sep='')
    input('Нажміть Enter для продовження')
  if s == 6:            #Рівняння Фішера
    M=int(input('Кількість грошей в обороті-->'))
    V=int(input('Швидкість оберту коштів-->'))
    P=int(input('Рівень цін-->'))
    Q=int(input('Обєм випуску-->'))
    Si= M * V
    Pi= P * Q
    print("За рівнянням Фішера відповідь-->",Si,"=",Pi, sep='')
    input('Нажміть Enter для продовження')
  if s == 7:
    zq=int(input('Чистий прибуток-->'))
    zx=int(input('Власний капітал-->'))
    rvk= zx / zq
    print("Рентабельність власного капіталу",rvk)
    input('Нажміть Enter для продовження');
  if s == 8:
    class podat:
      fizdoh= 18;
      vs=1.5;
      pdv=20
      pdpdoh=18
      zempod=0.1  #0.1-3
      epfop=3    #3-5

    a1=podat()         #Екземпляр 1 класу податок
    a2=podat()         #Екзимпляр 2 класу податок 
    
    a1.fizdoh = 18
    a1.vs = 1.5
    a1.pdv = 20
    a1.pdpdoh = 18
    a1.zempod = 0.1
    a2.zempod = 3
    a1.epfop = 3
    a2.epfop = 5
    print("Податок на фізичний дохід ", a1.fizdoh, "%", sep="")
    print("Воєнний збір ", a1.vs, "%", sep="")
    print("Податок на додану вартість ",a1.pdv, "%", sep="")
    print("Податок із пасивного доходу ",a1.pdpdoh, "%", sep="")
    print("Земельний податок від ", a1.zempod, " до ", a2.zempod, "%", sep="")
    print("Єфиний податок для фопів від ", a1.epfop, " до ", a2.epfop, "%", sep="")
    input("Нажміть Enter щоб продовжити")

 