  #Економіст
while True:	
  print("/------------------------\ ")
  print("|   Помічник економіста  |")
  print("\------------------------/ ",end='\n\n')
  print('1. Розрахунок заробітньої платні працівника"На руки".')
  print("2. Калькулятор відсотків")
  print("3. Конвертатор валют")
  print("4. ")
  print("5. ")
  print("6. Про програму")
  print("0. Вихід",end='\n\n')
  
  s = int(input("Оберіть пункт меню:->"))
  print(end='\n\n')
  if s == 0:
    print("Роботу завершено.")
    exit()
  if s == 6:       
    print("Розробник: Оврамець Ілля Володимирович")
    print("Група КН-20 підгрупа В")
    input('Нажміть Enter для продовження')
  if s == 1:
    h = int(input('Введіть вартість 1 робочої години:'))
    _v = int(input('Введіть кількість робочих годин:'))
    rp=h*_v
    pri=rp / 100 * 19.5
    salari=rp-pri
    print('Заробітна платня робітника "Грязними" :',rp)
    print('Податок в цілому',pri)
    print('Заробітна платня робітника "На руки" :',salari)

  if s == 2:
    summ=int(input('Введіть суму->'))
    oper=input('Виберіть операцію + чи - ==>')
    proc=int(input('Введіть вітсоток на який слід збільшити чи зменшити суму->'))
    _proc=summ/100*proc
    if oper == '+':
      rez=summ+_proc
      print("Результат",rez)
    if oper == '-':
      rez=summ-_proc
      print("Результат",rez)
    input('Нажміть Enter для продовження')
  if s == 3:
    kur=float(input('Введіть курс вальти в яку будете конверувати-->'))
    moni=int(input('Введіть суму яку хочете конвертувати-->'))
    _rez = kur * moni
    print("Сума після конвертації:",_rez);
  #if s == 4:




