
class Allinfo:                     #Опис сайту;
    neme="Steam"                   #Назва сайту;
    vlas="Гейб Нюел"               #Власник;
    dev="Valve"                    #Розробник;
    pop="CS:GO"                    #Найбільш популярна продукт;
    napr="Продаж ігор"             #Направлення сайту;
    datr=1999                      #Був Створений (Рік);
    rozm=35                  #Відсоток від продажу товарів обо пслуг;
    igr=3000                       #Кількість товарів ;
    leng="C++"                     #Написано на;
    aktiv="Активно"                #Стан розробки;


a1=Allinfo()                  #Перший екземпляр класуa Allinfo;
a2=Allinfo()                  #Другий екземпляр класуa Allinfo;
a3=Allinfo()                  #Третій екземпляр класуa Allinfo;

a1.neme="Steam";
a1.vlas="Гейб Нюел";
a1.dev="Valve";
a1.pop="CS:GO";
a1.napr="Продаж ігор";
a1.datr, a1.rozm,a1.igr=1999,35,30000;
a1.leng="C++";
a1.aktiv="Активно";

a2.neme="Rozetka";
a2.vlas="Владислав Чечоткін";
a2.dev="Rozetka";
a2.pop="PS-5";
a2.napr="Інтернет магазин";
a2.datr, a2.rozm,a2.igr=2005,20,2500;
a2.leng="C++";
a2.aktiv="Активно";

a3.neme="Prom";
a3.vlas="EVO";
a3.dev="EVO";
a3.pop="iPhone 12";
a3.napr="Інтернет магазин";
a3.datr, a3.rozm, a3.igr=2005, 20, 10.5;
a3.leng="C++";
a3.aktiv="Активно";

print("Назва сайту:",a1.neme)
print("Власник:",a1.vlas)
print("Розробник:",a1.dev)
print("Найбільш популярна продукт:",a1.pop)
print("Спецілізація:",a1.napr)
print("Був Створений в:",a1.datr,"році")
print("Відсоток від продажу товарів обо пслуг: ",a1.rozm,"%",sep='')
print("Кількість товарів:",a1.igr,"млн.")
print("Написано на:",a1.leng)
print("Стан розробки:",a1.aktiv,end='\n\n')

print("Назва сайту:",a2.neme)
print("Власник:",a2.vlas)
print("Розробник:",a2.dev)
print("Найбільш популярна продукт:",a2.pop)
print("Спецілізація:",a2.napr)
print("Був Створений в:",a2.datr,"році")
print("Відсоток від продажу товарів обо пслуг: ",a2.rozm,"%",sep='')
print("Кількість товарів:",a2.igr,"млн.")
print("Написано на:",a2.leng)
print("Стан розробки:",a2.aktiv,end='\n\n')

print("Назва сайту:",a3.neme)
print("Власник:",a3.vlas)
print("Розробник:",a3.dev)
print("Найбільш популярна продукт:",a3.pop)
print("Спецілізація:",a3.napr)
print("Був Створений в:",a3.datr,"році")
print("Відсоток від продажу товарів обо пслуг: ",a3.rozm,"%",sep='')
print("Кількість товарів:",a3.igr,"млн.")
print("Написано на:",a3.leng)
print("Стан розробки:",a3.aktiv, end='\n\n')

class serv:                        #Клас серверна частина;
  monl=100                         #Кількість людей яких витримає сайт;
  onl=17                           #Онлайн на місяць в млн.;
  ses="apach"                      #Система на якій встановлено сайт (apach,ngnx);
  oper=555                         #Кількість оперативки для сайту;
  osx="Windows"                    #Операційна система хостингу;
  port=80                          #Порт на якому працює сайт(80,8080);
  slsport=433                      #Порт на якому працює ssl-протокол сайта(443,8443);
  mms=3                            #Швидкість загрузки сайту в (мс);
  per="Присутня"                   #Переадресація на Https;
  ser=2                            #Середня швидкість інтернету для комфортного викорестання;

a1=serv()                  #Перший екземпляр класуa serv;
a2=serv()                  #Другий екземпляр класуa serv;
a3=serv()                  #Третій екземпляр класуa serv;

a1.monl,a1.onl,a1.oper,a1.port,a1.slsport,a1.mms,a1.sep=100000,17,1.5,8080,8443,28,2
a1.ses="apach"
a1.osx="Windows"
a1.per="Присутня"

a2.monl,a2.onl,a2.oper,a2.port,a2.slsport,a2.mms,a2.sep=1000000,10.5,1.5,8080,443,13,2
a2.ses="ngnx"
a2.osx="Windows"
a2.per="Присутня"

a3.monl,a3.onl,a3.oper,a3.port,a3.slsport,a3.mms,a3.sep=1000000,9.5,1.5,8080,443,13,2
a3.ses="ngnx"
a3.osx="Windows"
a3.per="Присутня"

print("Кількість людей яких витримає сайт:",a1.monl)
print("Онлайн на місяць",a1.onl,"млн.")
print("Кількість оперативки для сайту:",a1.oper)
print("Операційна система хостингу",a1.osx)
print("Порт на якому працює сайт(80,8080)",a1.port,end='')
print("ssl-протокол сайта(443,8443):",a1.slsport)
print("Система на якій встановлено сайт (apach,ngnx):",a1.ses)
print("Швидкість загрузки сайту:",a1.mms,"мілісекунд")
print("Середня швидкість інтернету для комфортного викорестанняф:",a1.sep, "МВ", end='\n\n')

print("Кількість людей яких витримає сайт:",a2.monl)
print("Онлайн на місяць",a2.onl,"млн.")
print("Кількість оперативки для сайту:",a2.oper)
print("Операційна система хостингу",a2.osx)
print("Порт на якому працює сайт(80,8080)",a2.port,end='')
print("ssl-протокол сайта(443,8443):",a2.slsport)
print("Система на якій встановлено сайт (apach,ngnx):",a2.ses)
print("Швидкість загрузки сайту:",a2.mms,"мілісекунд")
print("Середня швидкість інтернету для комфортного викорестанняф:",a2.sep, "МВ", end='\n\n')

print("Кількість людей яких витримає сайт:",a3.monl)
print("Онлайн на місяць",a3.onl,"млн.")
print("Кількість оперативки для сайту:",a3.oper)
print("Операційна система хостингу",a3.osx)
print("Порт на якому працює сайт(80,8080)",a3.port,end='')
print("ssl-протокол сайта(443,8443):",a3.slsport)
print("Система на якій встановлено сайт (apach,ngnx):",a3.ses)
print("Швидкість загрузки сайту:",a3.mms,"мілісекунд")
print("Середня швидкість інтернету для комфортного викорестанняф:",a3.sep, "МВ",end='\n\n')

class services:
  vic="Товари"                  #Контнт на сайті;
  pok="Закупка та продаж"       #Можливості торгівлі;
  part="Присутні"               #Партнери;
  holm="Ні"                     #Орієнтованість компанії на захід;
  dost="Так"                    #Можливість доставки товарів;
  chas=2                        #Середній час доставки;
  znih="Так"                    #Присутність знижок;
  opt="Так"                     #Присутність оптової закупки;
  pover="Так"                   #Можливість повернення покупки;
  mob="Так"                     #Наявність мобільного додатку;

a1=services()                  #Перший екземпляр класуa services;
a2=services()                  #Другий екземпляр класуa services;
a3=services()                  #Третій екземпляр класуa services;  

a1.vic="Ігри"
a1.pok="Закупка та продаж"
a1.part="Присутні"
a1.holm="Так"
a1.dost="Так"
a1.chas=10
a1.znih="Так"
a1.opt="Так"
a1.pover="Так"
a1.mob="Так"

a2.vic="Товари"
a2.pok="Закупка та продаж"
a2.part="Присутні"
a2.holm="Ні"
a2.dost="Так"
a2.chas=2
a2.znih="Так"
a2.opt="Так"
a2.pover="Так"
a2.mob="Так"

a3.vic="Товари"
a3.pok="Закупка та продаж"
a3.part="Присутні"
a3.holm="Ні"
a3.dost="Так"
a3.chas=2
a3.znih="Так"
a3.opt="Так"
a3.pover="Так"
a3.mob="Так"

print("Контнт на сайті:",a1.vic)
print("Можливості торгівлі:",a1.pok)
print("Партнери:",a1.part)
print("Орієнтованість компанії на захід:",a1.holm)
print("Можливість доставки товарів:",a1.dost)
print("Середній час доставки:",a1.chas,"днів")
print("Присутність знижок:",a1.znih)
print("Присутність оптової закупки:",a1.opt)
print("Можливість повернення покупки:",a1.pover)
print("Наявність мобільного додатку:",a1.mob,end='\n\n')

print("Контнт на сайті:",a2.vic)
print("Можливості торгівлі:",a2.pok)
print("Партнери:",a2.part)
print("Орієнтованість компанії на захід:",a2.holm)
print("Можливість доставки товарів:",a2.dost)
print("Середній час доставки:",a2.chas,"дні")
print("Присутність знижок:",a2.znih)
print("Присутність оптової закупки:",a2.opt)
print("Можливість повернення покупки:",a2.pover)
print("Наявність мобільного додатку:",a2.mob,end='\n\n')

print("Контнт на сайті:",a3.vic)
print("Можливості торгівлі:",a3.pok)
print("Партнери:",a3.part)
print("Орієнтованість компанії на захід:",a3.holm)
print("Можливість доставки товарів:",a3.dost)
print("Середній час доставки:",a3.chas,"дні")
print("Присутність знижок:",a3.znih)
print("Присутність оптової закупки:",a3.opt)
print("Можливість повернення покупки:",a3.pover)
print("Наявність мобільного додатку:",a3.mob,end='\n\n')

class desain:
  katal="Присутній"                 #Каталог
  posh="Присутній"                  #Можливість пошуку
  osobk="Присутній"                 #Особстий кабінет
  rek="Присутні"                    #Рекомендації для покупки
  spis="Присутній"                  #Список бажаного
  pidt="Присутня"                   #Підтримка
  up=1980                           #Розширення
  hor=1080                          #Розширення
  log="Присутній"                   #Логотоп сайту
  kart="Присутні"                   #Наявність ото презинтацій продукну

a1=desain()                  #Перший екземпляр класуa desain;
a2=desain()                  #Другий екземпляр класуa desain;
a3=desain()                  #Третій екземпляр класуa desain; 

a1.katal="Присутній"
a1.posh="Присутній"
a1.osobk="Присутній"
a1.rek="Присутні"
a1.spis="Присутній"
a1.pidt="Присутня"
a1.up=1980
a1.hor=1080
a1.log="Присутній"
a1.kart="Присутні"

a2.katal="Присутній"
a2.posh="Присутній"
a2.osobk="Присутній"
a2.rek="Присутні"
a2.spis="Присутній"
a2.pidt="Присутня"
a2.up=1980
a2.hor=1080
a2.log="Присутній"
a2.kart="Присутні"

a3.katal="Присутній"
a3.posh="Присутній"
a3.osobk="Присутній"
a3.rek="Присутні"
a3.spis="Присутній"
a3.pidt="Присутня"
a3.up=1980
a3.hor=1080
a3.log="Присутній"
a3.kart="Присутні"

print("Каталог:",a1.katal)
print("Можливість пошуку:",a1.posh)
print("Особстий кабінет:",a1.osobk)
print("Рекомендації для покупки:",a1.rek)
print("Список бажаного:",a1.spis)
print("Підтримка:",a1.pidt)
print("Розширення:",a1.up,"/",a1.hor,sep="")
print("Логотоп сайту:",a1.log)
print("Наявність ото презинтацій продукну:",a1.kart,end='\n\n')

print("Каталог:",a2.katal)
print("Можливість пошуку:",a2.posh)
print("Особстий кабінет:",a2.osobk)
print("Рекомендації для покупки:",a2.rek)
print("Список бажаного:",a2.spis)
print("Підтримка:",a2.pidt)
print("Розширення:",a2.up,"/",a2.hor,sep="")
print("Логотоп сайту:",a2.log)
print("Наявність ото презинтацій продукну:",a2.kart,end='\n\n')

print("Каталог:",a3.katal)
print("Можливість пошуку:",a3.posh)
print("Особстий кабінет:",a3.osobk)
print("Рекомендації для покупки:",a3.rek)
print("Список бажаного:",a3.spis)
print("Підтримка:",a3.pidt)
print("Розширення:",a3.up,"/",a3.hor,sep="")
print("Логотоп сайту:",a3.log)
print("Наявність ото презинтацій продукну:",a3.kart, end='\n\n')

class pidtrmka:
  timee=1                     #Очікування відповіді;
  reit=5                      #Рейтинг підтримки від 1 до 10;
  maxsl=5000                  #Максимальна кількість символів в повідоменні;
  rozs="Присутня"             #Розсилка;
  youtube="Присутній"         #Канал на youtube;
  fese="Присутній"            #fesebook;
  inst="Присутній"            #instagram;
  tvit="Присутній"            #twitter;
  vibr="Присутній"            #viber;
  gmail="Присутній"           #gmail;

a1=pidtrmka()                  #Перший екземпляр класуa pidtrmka;
a2=pidtrmka()                  #Другий екземпляр класуa pidtrmka;
a3=pidtrmka()                  #Третій екземпляр класуa pidtrmka;

a1.timee=1
a1.reit=5 
a1.maxsl=5000
a1.rozs="Присутня"
a1.youtube="Присутній"
a1.fese="Присутній"
a1.inst="Присутній"
a1.tvit="Присутній"
a1.vibr="Присутній"
a1.gmail="Присутній"

a2.timee=1
a2.reit=8 
a2.maxsl=5000
a2.rozs="Присутня"
a2.youtube="Присутній"
a2.fese="Присутній"
a2.inst="Присутній"
a2.tvit="Присутній"
a2.vibr="Присутній"
a2.gmail="Присутній"

a3.timee=1
a3.reit=9
a3.maxsl=5000
a3.rozs="Присутня"
a3.youtube="Присутній"
a3.fese="Присутній"
a3.inst="Присутній"
a3.tvit="Присутній"
a3.vibr="Присутній"
a3.gmail="Присутній"

print("Очікування відповіді:",a1.timee,"День", sep="")
print("Рейтинг підтримки від 1 до 10:",a1.reit)
print("Максимальна кількість символів в повідоменні:",a1.maxsl)
print("Розсилка:",a1.rozs)
print("Канал на youtube:",a1.youtube)
print("Канал на fesebook:",a1.fese)
print("Канал на instagram:",a1.inst)
print("Канал на twitter:",a1.tvit)
print("Канал на viber:",a1.vibr)
print("Канал на gmail:",a1.gmail,end='\n\n')

print("Очікування відповіді:",a2.timee,"Хв.", sep="")
print("Рейтинг підтримки від 1 до 10:",a2.reit)
print("Максимальна кількість символів в повідоменні:",a2.maxsl)
print("Розсилка:",a2.rozs)
print("Канал на youtube:",a2.youtube)
print("Канал на fesebook:",a2.fese)
print("Канал на instagram:",a2.inst)
print("Канал на twitter:",a2.tvit)
print("Канал на viber:",a2.vibr)
print("Канал на gmail:",a2.gmail,end='\n\n')

print("Очікування відповіді:",a3.timee,"Хв.", sep="")
print("Рейтинг підтримки від 1 до 10:",a3.reit)
print("Максимальна кількість символів в повідоменні:",a3.maxsl)
print("Розсилка:",a3.rozs)
print("Канал на youtube:",a3.youtube)
print("Канал на fesebook:",a3.fese)
print("Канал на instagram:",a3.inst)
print("Канал на twitter:",a3.tvit)
print("Канал на viber:",a3.vibr)
print("Канал на gmail:",a3.gmail)
