"""
A, B = 2.1, 7.4              #Значення А,В
C=B-0.0005
dx = 0.0005                  #Крок числа
y = 0;
x = A;
while x <= B:
  y = 3 * (x**3) - 2 * x + 1;       #Функція
  x += dx 
  if x==A:
    print("Мінімальне",y)   
  if x>=C:
    print("Максимальне:",y)  
   
#maxis=max(float(y))
#minis=min(float(y))
#print("Максимальное:",maxis)
#print("Минимальное:",minis)
#


while x <= B:
  y = 3 * (x**3) - 2 * x + 1;       #Функція
  x += dx                           #Збільшення числа х на установлений крок
  if y == (3 * (A**3)) - (2 * A) + 1:
     print ("Мінімальне",y);
  if y >= (3 * (C**3)) - (2 * C) + 1:
     print ("Максимальне",y);   
"""
